
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       5 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                      |
|:--------:|:---------------------------------------------------------------|
|    🟢     | `module.mediapc.aws_iam_access_key.backuper`                   |
|    🟢     | `module.mediapc.aws_iam_policy.backuper`                       |
|    🟢     | `module.mediapc.aws_iam_user.backuper`                         |
|    🟢     | `module.mediapc.aws_iam_user_policy_attachment.backuper`       |
|    🟢     | `module.mediapc.aws_s3_bucket.dst`                             |
|    🟢     | `data.aws_iam_policy_document.ih-tf-terraform-control-assume:` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/e91ade73-73d2-4887-81a8-1ca951957304/terraform-bin plan -no-color -var-file=configuration.tfvars --out=tf.plan
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1268673852]
data.aws_iam_policy.administrator-access: Reading...
aws_iam_user.aleks: Refreshing state... [id=aleks]
data.aws_iam_policy_document.allow-assume: Reading...
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Reading...
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
data.aws_iam_policy_document.allow-assume: Read complete after 0s [id=2219106455]
aws_iam_policy.allow-assume: Refreshing state... [id=arn:aws:iam::990466748045:policy/allow-assume]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2054866892]
module.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::990466748045:policy/ih-tf-aws-control-github]
aws_iam_access_key.aleks: Refreshing state... [id=AKIA6NHDLF2G665VS5V2]
data.aws_iam_policy_document.aws-admin: Reading...
data.aws_iam_policy_document.aws-admin: Read complete after 0s [id=2092112735]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Reading...
aws_iam_role.aws-admin: Refreshing state... [id=aws-admin]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=1250416815]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-github]
aws_iam_user_policy_attachment.aleks: Refreshing state... [id=aleks-20230630022352782000000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-github-20230824154108908400000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=4181394228]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-admin]
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230630023317121000000001]
aws_iam_role_policy_attachment.aws-admin: Refreshing state... [id=aws-admin-20230322021121795000000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-admin-20230703024608473400000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.mediapc.data.aws_iam_policy_document.backuper-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "backuper-permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.mediapc.aws_iam_access_key.backuper will be created
  + resource "aws_iam_access_key" "backuper" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = (known after apply)
    }

  # module.mediapc.aws_iam_policy.backuper will be created
  + resource "aws_iam_policy" "backuper" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-990466748045"
        }
    }

  # module.mediapc.aws_iam_user.backuper will be created
  + resource "aws_iam_user" "backuper" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = (known after apply)
      + path          = "/"
      + tags_all      = {
          + "created_by" = "infrahouse/aws-control-990466748045"
        }
      + unique_id     = (known after apply)
    }

  # module.mediapc.aws_iam_user_policy_attachment.backuper will be created
  + resource "aws_iam_user_policy_attachment" "backuper" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = (known after apply)
    }

  # module.mediapc.aws_s3_bucket.dst will be created
  + resource "aws_s3_bucket" "dst" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "twindb"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by" = "infrahouse/aws-control-990466748045"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mediapc-access-key = (sensitive value)
  + mediapc-bucket     = (known after apply)
  + mediapc-region     = (known after apply)
  + mediapc-secret-key = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1268673852]%0Adata.aws_iam_policy.administrator-access: Reading...%0Aaws_iam_user.aleks: Refreshing state... [id=aleks]%0Adata.aws_iam_policy_document.allow-assume: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Reading...%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Adata.aws_iam_policy_document.allow-assume: Read complete after 0s [id=2219106455]%0Aaws_iam_policy.allow-assume: Refreshing state... [id=arn:aws:iam::990466748045:policy/allow-assume]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2054866892]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::990466748045:policy/ih-tf-aws-control-github]%0Aaws_iam_access_key.aleks: Refreshing state... [id=AKIA6NHDLF2G665VS5V2]%0Adata.aws_iam_policy_document.aws-admin: Reading...%0Adata.aws_iam_policy_document.aws-admin: Read complete after 0s [id=2092112735]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Reading...%0Aaws_iam_role.aws-admin: Refreshing state... [id=aws-admin]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=1250416815]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-github]%0Aaws_iam_user_policy_attachment.aleks: Refreshing state... [id=aleks-20230630022352782000000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-github-20230824154108908400000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=4181394228]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-admin]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230630023317121000000001]%0Aaws_iam_role_policy_attachment.aws-admin: Refreshing state... [id=aws-admin-20230322021121795000000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-admin-20230703024608473400000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.mediapc.data.aws_iam_policy_document.backuper-permissions will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "backuper-permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:*",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A    }%0A%0A  # module.mediapc.aws_iam_access_key.backuper will be created%0A  + resource "aws_iam_access_key" "backuper" {%0A      + create_date                    = (known after apply)%0A      + encrypted_secret               = (known after apply)%0A      + encrypted_ses_smtp_password_v4 = (known after apply)%0A      + id                             = (known after apply)%0A      + key_fingerprint                = (known after apply)%0A      + secret                         = (sensitive value)%0A      + ses_smtp_password_v4           = (sensitive value)%0A      + status                         = "Active"%0A      + user                           = (known after apply)%0A    }%0A%0A  # module.mediapc.aws_iam_policy.backuper will be created%0A  + resource "aws_iam_policy" "backuper" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-990466748045"%0A        }%0A    }%0A%0A  # module.mediapc.aws_iam_user.backuper will be created%0A  + resource "aws_iam_user" "backuper" {%0A      + arn           = (known after apply)%0A      + force_destroy = false%0A      + id            = (known after apply)%0A      + name          = (known after apply)%0A      + path          = "/"%0A      + tags_all      = {%0A          + "created_by" = "infrahouse/aws-control-990466748045"%0A        }%0A      + unique_id     = (known after apply)%0A    }%0A%0A  # module.mediapc.aws_iam_user_policy_attachment.backuper will be created%0A  + resource "aws_iam_user_policy_attachment" "backuper" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + user       = (known after apply)%0A    }%0A%0A  # module.mediapc.aws_s3_bucket.dst will be created%0A  + resource "aws_s3_bucket" "dst" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = (known after apply)%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = "twindb"%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "created_by" = "infrahouse/aws-control-990466748045"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + mediapc-access-key = (sensitive value)%0A  + mediapc-bucket     = (known after apply)%0A  + mediapc-region     = (known after apply)%0A  + mediapc-secret-key = (sensitive value)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC9lOTFhZGU3My03M2QyLTQ4ODctODFhOC0xY2E5NTE5NTczMDQvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxuYXdzX2lhbV91c2VyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc11cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWxsb3ctYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hbGxvdy1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTkxMDY0NTVdXG5hd3NfaWFtX3BvbGljeS5hbGxvdy1hc3N1bWU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6cG9saWN5L2FsbG93LWFzc3VtZV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwNTQ4NjY4OTJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtZ2l0aHViXVxuYXdzX2lhbV9hY2Nlc3Nfa2V5LmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1BS0lBNk5IRExGMkc2NjVWUzVWMl1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXdzLWFkbWluOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmF3cy1hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjA5MjExMjczNV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3JvbGUuYXdzLWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtYWRtaW5dXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI1MDQxNjgxNV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtZ2l0aHViXVxuYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrcy0yMDIzMDYzMDAyMjM1Mjc4MjAwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtZ2l0aHViLTIwMjMwODI0MTU0MTA4OTA4NDAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE4MTM5NDIyOF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1hZG1pbl1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjMwMDIzMzE3MTIxMDAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmF3cy1hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWFkbWluLTIwMjMwMzIyMDIxMTIxNzk1MDAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWFkbWluLTIwMjMwNzAzMDI0NjA4NDczNDAwMDAwMDAxXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLm1lZGlhcGMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5iYWNrdXBlci1wZXJtaXNzaW9ucyB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pXG4gPD0gZGF0YSBcImF3c19pYW1fcG9saWN5X2RvY3VtZW50XCIgXCJiYWNrdXBlci1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiczM6KlwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICBdXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUubWVkaWFwYy5hd3NfaWFtX2FjY2Vzc19rZXkuYmFja3VwZXIgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX2FjY2Vzc19rZXlcIiBcImJhY2t1cGVyXCIge1xuICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGVuY3J5cHRlZF9zZWNyZXQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZW5jcnlwdGVkX3Nlc19zbXRwX3Bhc3N3b3JkX3Y0ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGtleV9maW5nZXJwcmludCAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc2VjcmV0ICAgICAgICAgICAgICAgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgICAgICsgc2VzX3NtdHBfcGFzc3dvcmRfdjQgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgICAgICsgc3RhdHVzICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJBY3RpdmVcIlxuICAgICAgKyB1c2VyICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV9wb2xpY3kuYmFja3VwZXIgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiYmFja3VwZXJcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyLmJhY2t1cGVyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV91c2VyXCIgXCJiYWNrdXBlclwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZm9yY2VfZGVzdHJveSA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgPSBcIi9cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICAgfVxuICAgICAgKyB1bmlxdWVfaWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5tZWRpYXBjLmF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC5iYWNrdXBlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudFwiIFwiYmFja3VwZXJcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHVzZXIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1lZGlhcGMuYXdzX3MzX2J1Y2tldC5kc3Qgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJkc3RcIiB7XG4gICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSBcInR3aW5kYlwiXG4gICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICAgfVxuICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cblBsYW46IDUgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5DaGFuZ2VzIHRvIE91dHB1dHM6XG4gICsgbWVkaWFwYy1hY2Nlc3Mta2V5ID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgKyBtZWRpYXBjLWJ1Y2tldCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICsgbWVkaWFwYy1yZWdpb24gICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICArIG1lZGlhcGMtc2VjcmV0LWtleSA9IChzZW5zaXRpdmUgdmFsdWUpXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcblJlbGVhc2luZyBzdGF0ZSBsb2NrLiBUaGlzIG1heSB0YWtlIGEgZmV3IG1vbWVudHMuLi5cbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNjg2NzM4NTJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQWF3c19pYW1fdXNlci5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3NdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hbGxvdy1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWxsb3ctYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE5MTA2NDU1XSUwQWF3c19pYW1fcG9saWN5LmFsbG93LWFzc3VtZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvYWxsb3ctYXNzdW1lXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwNTQ4NjY4OTJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLWdpdGh1Yl0lMEFhd3NfaWFtX2FjY2Vzc19rZXkuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFLSUE2TkhETEYyRzY2NVZTNVYyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXdzLWFkbWluOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hd3MtYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwOTIxMTI3MzVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3JvbGUuYXdzLWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtYWRtaW5dJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNTA0MTY4MTVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1naXRodWJdJTBBYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrcy0yMDIzMDYzMDAyMjM1Mjc4MjAwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1naXRodWItMjAyMzA4MjQxNTQxMDg5MDg0MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE4MTM5NDIyOF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtYWRtaW5dJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjMwMDIzMzE3MTIxMDAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hd3MtYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1hZG1pbi0yMDIzMDMyMjAyMTEyMTc5NTAwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWFkbWluLTIwMjMwNzAzMDI0NjA4NDczNDAwMDAwMDAxXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSA8PSByZWFkIChkYXRhIHJlc291cmNlcyklMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgbW9kdWxlLm1lZGlhcGMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5iYWNrdXBlci1wZXJtaXNzaW9ucyB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKSUwQSA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcImJhY2t1cGVyLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJzMzoqXCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgICArIHJlc291cmNlcyA9IFslMEEgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV9hY2Nlc3Nfa2V5LmJhY2t1cGVyIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fYWNjZXNzX2tleVwiIFwiYmFja3VwZXJcIiB7JTBBICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBlbmNyeXB0ZWRfc2VjcmV0ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBlbmNyeXB0ZWRfc2VzX3NtdHBfcGFzc3dvcmRfdjQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBrZXlfZmluZ2VycHJpbnQgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWNyZXQgICAgICAgICAgICAgICAgICAgICAgICAgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgICsgc2VzX3NtdHBfcGFzc3dvcmRfdjQgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICArIHN0YXR1cyAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQWN0aXZlXCIlMEEgICAgICArIHVzZXIgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUubWVkaWFwYy5hd3NfaWFtX3BvbGljeS5iYWNrdXBlciB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiYmFja3VwZXJcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tZWRpYXBjLmF3c19pYW1fdXNlci5iYWNrdXBlciB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3VzZXJcIiBcImJhY2t1cGVyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZvcmNlX2Rlc3Ryb3kgPSBmYWxzZSUwQSAgICAgICsgaWQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICAgID0gXCIvXCIlMEEgICAgICArIHRhZ3NfYWxsICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCIlMEEgICAgICAgIH0lMEEgICAgICArIHVuaXF1ZV9pZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LmJhY2t1cGVyIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudFwiIFwiYmFja3VwZXJcIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHVzZXIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1lZGlhcGMuYXdzX3MzX2J1Y2tldC5kc3Qgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwiZHN0XCIgeyUwQSAgICAgICsgYWNjZWxlcmF0aW9uX3N0YXR1cyAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0X3ByZWZpeCAgICAgICAgICAgICAgID0gXCJ0d2luZGJcIiUwQSAgICAgICsgYnVja2V0X3JlZ2lvbmFsX2RvbWFpbl9uYW1lID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeSAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlZ2lvbiAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIiUwQSAgICAgICAgfSUwQSAgICAgICsgd2Vic2l0ZV9kb21haW4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgd2Vic2l0ZV9lbmRwb2ludCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBUGxhbjogNSB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBQ2hhbmdlcyB0byBPdXRwdXRzOiUwQSAgKyBtZWRpYXBjLWFjY2Vzcy1rZXkgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgKyBtZWRpYXBjLWJ1Y2tldCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICArIG1lZGlhcGMtcmVnaW9uICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICsgbWVkaWFwYy1zZWNyZXQta2V5ID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFSZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDUsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>